// Задача 34: Задайте массив заполненный случайными положительными трёхзначными числами.
// Напишите программу, которая покажет количество четных чисел в массиве.
// [345, 897, 568, 234] -> 2

 
        // int[] array = new int[10];
        // Random random = new Random();
        // for (int i = 0; i < array.Length; i++)
        // {
        //     array[i] = random.Next(100, 1000); // Генерируем случайное трёхзначное число
        // }

        
        // Console.WriteLine("Массив: " + String.Join(", ", array));

        // int count = array.Count(n => n % 2 == 0);

        // Console.WriteLine("Количество чётных чисел: " + count);
    



//  Задача 36: Задайте одномерный массив, заполненный случайными числами.  Найдите сумму элементов,
//  стоящих на нечетных позициях.
// [3, 7, 23, 12] -> 19
// [-4, -6, 89, 6] -> 0   

 
        // int[] array = new int[10];
        // Random random = new Random();
        // for (int i = 0; i < array.Length; i++)
        // {
        //     array[i] = random.Next(-100, 101); // Генерируем случайное число от -100 до 100
        // }

        // Console.WriteLine("Массив: " + String.Join(", ", array));

        // // Находим сумму элементов, стоящих на нечётных позициях
        // int sum = array.Where((n, i) => i % 2 != 0).Sum();

        // Console.WriteLine("Сумма элементов на нечётных позициях: " + sum);



        // Задача 38: Задайте массив вещественных чисел. Найдите разницу между  
        // максимальным и минимальным элементов массива.
        // [3.22, 4.2, 1.15, 77.15, 65.2] => 77.15 - 1.15 = 76

    
        // double[] array = { 3.22, 4.2, 1.15, 77.15, 65.2 };

        // double max = array.Max();
        // double min = array.Min();

        // double diff = max - min;

        // Console.WriteLine("Разница между максимальным и минимальным элементами: " + diff);
    
    
    
